---
kind: type
id: T:Autodesk.Revit.Exceptions.InvalidOperationException
source: html/9e715f03-3884-e539-4dd6-8d7545733adc.htm
---
# Autodesk.Revit.Exceptions.InvalidOperationException

The exception that is thrown when a method call is invalid for the object's current state.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class InvalidOperationException : ApplicationException
```